/**
  ******************************************************************************
  * @file    ZYSlib/zlib_memory.c
  * @author  ZYS
  * @version V1.0.0
  * @date    08/21/2015
  * @brief   这是一个处理一些内存操作的文件，如清除、拷贝,交换等。
  ******************************************************************************
  */


/* Debug log -----------------------------------------------------------------*/

/* Includes ------------------------------------------------------------------*/
#include ".\zlib_memory.h"

/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Global  variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/





/*   Z L _ M E M O R Y _ S E T   */
/*-------------------------------------------------------------------------
    * 功能：设置内存块中的一段区域为指定数据。
    * 参数：1.目标起始地址，可能要强制转换（uint8_t *）;
    *       2.要设置的数据；
    *       3.内存的字节数，可用sizeof求得。
    * 返回：无
    * 备注：OK.
-------------------------------------------------------------------------*/
void zl_memory_set(uint8_t *pchDest, uint8_t chData, uint16_t hwSize)
{
    while (hwSize--)
    {
        *pchDest++ = chData;
    }
}


/*   Z L _ M E M O R Y _ C L E A R   */
/*-------------------------------------------------------------------------
    * 功能：清除内存块中的一段区域。
    * 参数：1.目标起始地址，可能要强制转换（uint8_t *）;
    *       2.清除的字节数，可用sizeof求得。
    * 返回：无
    * 备注：OK.
-------------------------------------------------------------------------*/
void zl_memory_clear(uint8_t *pchDest, uint16_t hwSize)
{
    zl_memory_set(pchDest, 0, hwSize);
}


/*   Z L _ M E M O R Y _ C O P Y   */
/*-------------------------------------------------------------------------
    * 功能：拷贝一段内存数据。
    * 参数：1.目标起始地址，可能要强制转换（uint8_t *）;
    *       2.源起始地址；
    *       3.拷贝的字节数，可用sizeof求得。
    * 返回：无
    * 备注：OK.

    可用于复制结构体数据等。
-------------------------------------------------------------------------*/
void zl_memory_copy(uint8_t *pchDest, uint8_t *pchSrc, uint16_t hwSize)
{
    while (hwSize--)
    {
        *pchDest++ = *pchSrc++;
    }
}


/*   Z L _ M E M O R Y _ S W A P   */
/*-------------------------------------------------------------------------
    * 功能：通用交换，负责交换两个数据的内容。
    * 参数：1.第一个数据的指针，强制转为空指针类型；
    *       2.第二个数据的指针；
    *       3.数据类型的大小，可用sizeof求得。
    * 返回：无
    * 备注：OK.

    要交换的两个数据必须是同样的类型，如同类型结构体等。
-------------------------------------------------------------------------*/
void zl_memory_swap(void *const Datax, void *const Datay, uint8_t chSize)
{
    uint8_t *pchDx, *pchDy;
    uint8_t chTemp;


    if ((NULL == Datax) || (NULL == Datay))
    {
        return;
    }

    pchDx = (uint8_t*)Datax;
    pchDy = (uint8_t*)Datay;

    while (chSize--)
    {
        chTemp = *pchDx;
        *pchDx = *pchDy;
        *pchDy = chTemp;

        pchDx++;
        pchDy++;
    }
}


/*************************** (C) COPYRIGHT 2015 ZYS ************END OF FILE****/

